src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_РасположенияИБ/бир_РасположенияИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_РасположенияИБ</name>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаРасположения</name>
    <type>
      <types>CatalogRef.бир_НастройкиРасположенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокСистемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьЗаголовокСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСообщениеПользователю</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияПользователю</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_РасположенияИБ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ЗаголовокСистемы.СписокВыбора.Добавить("");
	Элементы.ЗаголовокСистемы.СписокВыбора.Добавить(Константы.ЗаголовокСистемы.Получить());
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСписокИБ();
	
	ОбновитьОформлениеЭлементовФормы();

КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипБазыПриИзменении(Элемент)
	
	ОбновитьОформлениеЭлементовФормы();

	ЗаполнитьСписокИБ();

КонецПроцедуры // ТипБазыПриИзменении()

&НаКлиенте
Процедура УстановитьЗаголовокСистемыПриИзменении(Элемент)
	
	ОбновитьОформлениеЭлементовФормы();
	
КонецПроцедуры // УстановитьЗаголовокСистемыПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьТекущимРасположением(Команда)
	
	ГлавныйСтильИзменен = бир_РасположениеИБВызовСервера.ГлавныйСтильИзменен(, Объект.НастройкаРасположения);

	Если ГлавныйСтильИзменен Тогда
		ТекущийГлавныйСтиль = бир_РасположениеИБВызовСервера.ГлавныйСтильРасположенияИБ();
		НовыйГлавныйСтиль = бир_РасположениеИБВызовСервера.ГлавныйСтильРасположенияИБ(Объект.НастройкаРасположения);
	КонецЕсли;

	бир_РасположениеИБВызовСервера.ОбновитьТекущееРасположениеИБ(Объект.Ссылка);
	
	Если ГлавныйСтильИзменен Тогда
		ТекстВопроса = СтрШаблон("Изменен стиль для текущего расположения ИБ (""%1"" -> ""%2"").
		                         |Изменения вступят в силу после перезапуска.
								 |
								 |Перезапустить приложение?",
		                         ТекущийГлавныйСтиль,
								 НовыйГлавныйСтиль);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПерезапуститьПриложение", ЭтаФорма);
		
		ПоказатьВопрос(ОписаниеОповещения,
		               ТекстВопроса,
					   РежимДиалогаВопрос.ДаНет,
					   20,
					   КодВозвратаДиалога.Нет,
					   "Перезапуск приложения",
					   КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры // УстановитьТекущимСервером()

&НаКлиенте
Процедура ПерезапуститьПриложение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьРаботуСистемы(Истина, Истина);

КонецПроцедуры // ПерезапуститьПриложение()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСписокБазПоФайлу(ИмяФайла, СписокСерверов, СписокИБ, ВерсияПоУмолчанию = "V83")
	
	Если НЕ ТипЗнч(СписокСерверов) = Тип("СписокЗначений") Тогда
		СписокСерверов = Новый СписокЗначений();
	КонецЕсли;
	Если НЕ ТипЗнч(СписокИБ) = Тип("СписокЗначений") Тогда
		СписокИБ = Новый СписокЗначений();
	КонецЕсли;
	ВремФайл = Новый Файл(ИмяФайла);
	Если НЕ ВремФайл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеФайлаИБ = Новый ЧтениеТекста;
	ЧтениеФайлаИБ.Открыть(ИмяФайла, КодировкаТекста.UTF8);
	Стр = ЧтениеФайлаИБ.ПрочитатьСтроку();
	НаименованиеИБ = "";
	ВерсияИБ = ВерсияПоУмолчанию;
	ПараметрыПодключения = Неопределено;
	Пока НЕ Стр = Неопределено Цикл
		ТекСтрока = СокрЛП(Стр);
		ДлинаСтроки = СтрДлина(ТекСтрока);
		Если ДлинаСтроки > 0 Тогда
			
			ПолеОписания = Лев(ТекСтрока, 8);
			
			Если Лев(ТекСтрока, 1) = "[" Тогда
				ДобавитьИБВСписок(ПараметрыПодключения, СписокСерверов, СписокИБ);
				НаименованиеИБ = Сред(ТекСтрока, 2, ДлинаСтроки - 2);
				ВерсияИБ = ВерсияПоУмолчанию;
				ПараметрыПодключения = Неопределено;
			КонецЕсли;
			
			Если ПолеОписания = "Connect=" Тогда
				СтрокаПодключения = Сред(ТекСтрока, 9);
				ПараметрыПодключения =
					бир_РасположениеИБКлиентСервер.ПараметрыПодключенияИзСтрокиСоединенияИБ(СтрокаПодключения);
			ИначеЕсли ПолеОписания = "Version=" Тогда
				НомерВерсии = Сред(ТекСтрока, 9, 3);
				ВерсияИБ = ?(НомерВерсии = "8.1", "V81", ?(НомерВерсии = "8.2", "V82", ВерсияПоУмолчанию));
			КонецЕсли;     						
		КонецЕсли;
		Стр = ЧтениеФайлаИБ.ПрочитатьСтроку();
	КонецЦикла;
	ДобавитьИБВСписок(ПараметрыПодключения, СписокСерверов, СписокИБ);
	
КонецПроцедуры // ЗаполнитьСписокБазПоФайлу()

&НаКлиенте
Процедура ДобавитьИБВСписок(ПараметрыПодключения, СписокСерверов, СписокИБ)
	
	Если НЕ ТипЗнч(ПараметрыПодключения) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Если НЕ (Объект.ТипБазы = 0
	 ИЛИ Объект.ТипБазы = ПараметрыПодключения.ТипБазы) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыБаз = бир_РасположениеИБКлиентСервер.ТипыБаз();
	Если ПараметрыПодключения.ТипБазы = ТипыБаз.Файловая Тогда 
		Если ЗначениеЗаполнено(ПараметрыПодключения.КаталогБазы)
		   И СписокИБ.НайтиПоЗначению(ПараметрыПодключения.КаталогБазы) = Неопределено Тогда
			СписокИБ.Добавить(ПараметрыПодключения.КаталогБазы,
			                  ПараметрыПодключения.КаталогБазы,
			                  ,
			                  БиблиотекаКартинок.ПланОбменаОбъект);
		КонецЕсли;
	ИначеЕсли ПараметрыПодключения.ТипБазы = ТипыБаз.Серверная Тогда 
		Если ЗначениеЗаполнено(ПараметрыПодключения.АдресСервера)
		   И СписокСерверов.НайтиПоЗначению(ПараметрыПодключения.АдресСервера) = Неопределено Тогда
			СписокСерверов.Добавить(ПараметрыПодключения.АдресСервера,
			                        ПараметрыПодключения.АдресСервера);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыПодключения.ИмяБазы)
		   И СписокИБ.НайтиПоЗначению(ПараметрыПодключения.ИмяБазы) = Неопределено Тогда
			СписокИБ.Добавить(ПараметрыПодключения.ИмяБазы,
			                  ПараметрыПодключения.ИмяБазы,
			                  ,
			                  БиблиотекаКартинок.ПланОбменаОбъект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ДобавитьИБВСписок()

&НаКлиенте
Процедура ЗаполнитьСписокИБ()
	
	Элементы.ИмяСервера.СписокВыбора.Очистить();
	Если НЕ Объект.ТипБазы = бир_РасположениеИБКлиентСервер.ТипыБаз().Файловая Тогда
		Элементы.ИмяСервера.СписокВыбора.Добавить("");
		ИмяКомпьютера = ИмяКомпьютера();
		Элементы.ИмяСервера.СписокВыбора.Добавить(ИмяКомпьютера, ИмяКомпьютера);

		ИмяСервера = бир_РасположениеИБВызовСервера.ИмяСервера();		
		Если Элементы.ИмяСервера.СписокВыбора.НайтиПоЗначению(ИмяСервера) = Неопределено Тогда
			Элементы.ИмяСервера.СписокВыбора.Добавить(ИмяСервера, ИмяСервера);
		КонецЕсли;
	КонецЕсли;

	Элементы.ИмяБазы.СписокВыбора.Очистить();
	Элементы.ИмяБазы.СписокВыбора.Добавить("");
	
	#Если НЕ ВебКлиент Тогда
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		КаталогAppData = бир_РасположениеИБКлиент.КаталогAppData();
		
		ПутьКСпискуБаз = СтрШаблон("%1\1C\1Cestart\ibases.v8i", КаталогAppData);
		ЗаполнитьСписокБазПоФайлу(ПутьКСпискуБаз, Элементы.ИмяСервера.СписокВыбора, Элементы.ИмяБазы.СписокВыбора, "V83");
		
		ПутьКСпискуБаз = СтрШаблон("%1\1C\1Cv82\ibases.v8i", КаталогAppData);
		ЗаполнитьСписокБазПоФайлу(ПутьКСпискуБаз, Элементы.ИмяСервера.СписокВыбора, Элементы.ИмяБазы.СписокВыбора, "V82");
		
		Элементы.ИмяСервера.СписокВыбора.СортироватьПоПредставлению();
		Элементы.ИмяБазы.СписокВыбора.СортироватьПоПредставлению();
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры // ЗаполнитьСписокИБ()

&НаКлиенте
Процедура ОбновитьОформлениеЭлементовФормы()
	
	ТипыБаз = бир_РасположениеИБКлиентСервер.ТипыБаз();
	Элементы.ИмяСервера.Видимость = (Объект.ТипБазы = ТипыБаз.Серверная);
	Элементы.ИмяБазы.Заголовок = ?(Объект.ТипБазы = ТипыБаз.Файловая,
	                               "Путь к базе",
	                               "Имя базы");
	Элементы.ЗаголовокСистемы.Видимость = Объект.УстановитьЗаголовокСистемы;

КонецПроцедуры // ОбновитьОформлениеЭлементовФормы()

#КонецОбласти
